Revit 2027 API
GeometryCreationUtilities.CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>, SolidOptions) Method
 Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Solid CreateSweptBlendGeometry(
	Curve pathCurve,
	IList<double> pathParams,
	IList<CurveLoop> profileLoops,
	IList<ICollection<VertexPair>> vertexPairs,
	SolidOptions solidOptions
)
Public Shared Function CreateSweptBlendGeometry (
	pathCurve As Curve,
	pathParams As IList(Of Double),
	profileLoops As IList(Of CurveLoop),
	vertexPairs As IList(Of ICollection(Of VertexPair)),
	solidOptions As SolidOptions
) As Solid
public:
static Solid^ CreateSweptBlendGeometry(
	Curve^ pathCurve,
	IList<double>^ pathParams,
	IList<CurveLoop^>^ profileLoops,
	IList<ICollection<VertexPair^>^>^ vertexPairs,
	SolidOptions^ solidOptions
)
static member CreateSweptBlendGeometry :
        pathCurve : Curve *
        pathParams : IList<float> *
        profileLoops : IList<CurveLoop> *
        vertexPairs : IList<ICollection<VertexPair>> *
        solidOptions : SolidOptions -> Solid
Parameters
pathCurve Curve
 The sweep path, consisting of a single bounded, open curve.
pathParams IList<Double>
 An increasing sequence of parameters along the path curve (lying within the curve's bounds). These parameters specify the locations of the planes orthogonal to the path that contain the profile loops. This array must have the same size as the input array "profileLoops".
profileLoops IList<CurveLoop>
 Closed, planar curve loops arrayed along the path. No loop may contain just one closed curve - split such loops into two or more curves beforehand. The solid will have these profiles as cross-sections at the points specified by the input pathParams. The solid will blend smoothly between the profiles. This array must have the same size as the input array "pathParams", and each profile loop must lie in the plane orthogonal to the path at the point specified by the corresponding entry in the input array "pathParams". Each profile loop must define a single planar domain and must be free of intersections and degeneracies. No orientation conditions on the loops are imposed.
vertexPairs IList<ICollection<VertexPair>>
 This input specifies how adjacent profile loops should be connected. It must contain one less element than the "profileLoops" input, and entry vertexPairs[idx] specifies how profileLoops[idx] and profileLoops[idx+1] should be connected (indexing starts at 0).
solidOptions SolidOptions
 The optional information to control the properties of the Solid.
Return Value
Solid
 The requested solid.
Exceptions
Exception | Condition
ArgumentException |  The input pathCurve is a helical curve and is not supported for this operation. -or- The input argument pathCurve should be bounded. The input argument pathCurve should be non-degenerate. -or- The input argument pathParams should be an increasing array. -or- The profile CurveLoops do not satisfy the input requirements.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
GeometryCreationUtilities Class
CreateSweptBlendGeometry Overload
Autodesk.Revit.DB Namespace